Repository: mohammed-2-5/azkar
Catalog: lib/l10n/app_*.arb
Languages: ar

# appTitle
source: Azkar
ar: أذكار

# navPrayer
source: Prayer
ar: الصلاة

# navQiblah
source: Qiblah
ar: القبلة

# navAzkar
source: Azkar
ar: أذكار

# navQuran
source: Qur'an
ar: القرآن

# prayerTitle
source: Prayer Times
ar: مواقيت الصلاة

source: Current Location
ar: الموقع الحالي

source: Next
ar: التالي

source: Settings
ar: الإعدادات

source: Appearance
ar: المظهر

# calcTitle
source: Prayer Calculation
ar: إعدادات الحساب

source: Location
ar: الموقع

source: Use device
ar: استخدام الجهاز

source: Choose city
ar: اختر مدينة

source: Method
ar: طريقة الحساب

source: Madhab
ar: المذهب

source: High Latitude
ar: خط العرض العالي

# hour24
source: 24-hour clock
ar: نظام 24 ساعة

source: Notifications
ar: الإشعارات

# enableReminders
source: Enable prayer reminders
ar: تفعيل تذكيرات الصلاة

source: Lead time
ar: الوقت المسبق

# minutes
source: {m} min
ar: {m} دقيقة

source: Favorites
ar: المفضلة

source: Search duas...
ar: ابحث عن الدعاء...

# azkarTitle
source: Azkar
ar: أذكار

# qiblahTitle
source: Qiblah
ar: القبلة

# qiblahSubtitle
source: Find the Kaaba direction
ar: اعثر على اتجاه الكعبة

source: Language
ar: اللغة

# appearanceTitle
source: Appearance
ar: المظهر

source: Primary Color
ar: اللون الأساسي

source: Save
ar: حفظ

source: Reschedule Now
ar: إعادة الجدولة الآن

# chooseCityTitle
source: Choose City
ar: اختيار مدينة

source: Fajr
ar: الفجر

source: Sunrise
ar: الشروق

source: Dhuhr
ar: الظهر

source: Asr
ar: العصر

source: Maghrib
ar: المغرب

source: Isha
ar: العشاء

# catMorning
source: Morning
ar: صباح

# catEvening
source: Evening
ar: مساء

# catAfterPrayer
source: After Prayer
ar: بعد الصلاة

# catSleep
source: Sleep
ar: النوم

# catDoaa
source: Supplications
ar: أدعية

# todayHijri
source: Hijri: {date}
ar: هجري: {date}

# qiblahLabel
source: Qiblah {deg}째
ar: القبلة {deg}°

# headingLabel
source: Heading {deg}째
ar: الاتجاه {deg}°

source: Time remaining
ar: الوقت المتبقي

# progressLabel
source: Progress
ar: التقدم

source: Favorites ({count})
ar: المفضلة ({count})

# favoritesScreenTitle
source: Favorites
ar: المفضلة

# noFavorites
source: No favorites yet.
ar: لا توجد عناصر مفضلة بعد.

# prayerForecast
source: Prayer times (next {days} days)
ar: الصلاة خلال {days} يومًا القادمة

# calibrationHint
source: Move phone in a figure-8 to calibrate if needed
ar: حرّك الهاتف بشكل رقم 8 للمعايرة عند الحاجة

# qrToggleTr
source: Toggle translation
ar: إظهار/إخفاء الترجمة

# qrToggleTrans
source: Toggle transliteration
ar: إظهار/إخفاء الترجمة الصوتية

source: Continue reading
ar: متابعة القراءة

source: Search...
ar: بحث...

source: Bookmark
ar: علامة

source: Copy
ar: نسخ

source: Copied
ar: تم النسخ

# viewMushaf
source: Mushaf view
ar: عرض المصحف

# viewTiles
source: Tile view
ar: عرض البطاقات

# permissionTitle
source: Location Permission Needed
ar: مطلوب إذن الموقع

# permissionAcquiring
source: Acquiring your current location...
ar: جارٍ الحصول على موقعك الحالي...

# permissionGps
source: Turn on Location Services (GPS) to continue.
ar: فعّل خدمات الموقع (GPS) للمتابعة.

# permissionWhy
source: We use your location to compute accurate prayer times and Qiblah direction.
ar: نستخدم موقعك لحساب مواقيت الصلاة بدقة وتحديد اتجاه القبلة.

# permissionLocationError
source: Unable to acquire location. Ensure GPS is on and try again.
ar: تعذّر الحصول على الموقع. تأكد من تشغيل GPS ثم حاول مرة أخرى.

# permissionGrant
source: Grant Permission
ar: منح الإذن

# permissionGetLocation
source: Get Current Location
ar: الحصول على موقعي الحالي

# permissionOpenSettings
source: Open Settings
ar: فتح الإعدادات

# permissionRetry
source: Retry
ar: إعادة المحاولة

# appearanceThemeMode
source: Theme mode
ar: وضع المظهر

# appearanceModeSystem
source: System
ar: النظام

# appearanceModeLight
source: Light
ar: فاتح

# appearanceModeDark
source: Dark
ar: داكن

# appearanceColorDarkGrey
source: Dark Grey
ar: رمادي داكن

# appearanceColorEmerald
source: Emerald
ar: زمردي

# appearanceColorTeal
source: Teal
ar: تركوازي

# appearanceColorIndigo
source: Indigo
ar: نيلي

# appearanceColorPurple
source: Purple
ar: أرجواني

# appearanceColorAmber
source: Amber
ar: كهرماني

# appearanceColorPink
source: Pink
ar: وردي

# appearanceColorBrown
source: Brown
ar: بني

source: Apply
ar: تطبيق

# prayerSettingsOpenNotifications
source: Notifications
ar: الإشعارات

# notificationsSaved
source: Notification settings saved
ar: تم حفظ إعدادات الإشعارات

# notificationsTestScheduledTitle
source: Test Scheduled
ar: تم جدولة الاختبار

# notificationsTestScheduledBody
source: Notification and sound will play in 15 seconds.
ar: سيتم تشغيل الإشعار والصوت بعد 15 ثانية.

# notificationsTestScheduledSnack
source: Test scheduled! You should see a notification and hear the adhan in 15 seconds.
ar: تمت جدولة الاختبار! ستصلك إشعار وتسمع الأذان بعد 15 ثانية.

# notificationsButtonTestScheduled
source: Test adhan notification (15s)
ar: اختبار إشعار الأذان (15 ثانية)

# notificationsInstantTitle
source: Instant Test
ar: اختبار فوري

# notificationsInstantBody
source: If you see this, basic notifications work!
ar: إذا رأيت هذا الإشعار فالإعدادات تعمل بشكل صحيح!

# notificationsInstantSnack
source: Instant notification sent (no sound test).
ar: تم إرسال إشعار فوري (بدون صوت).

# notificationsButtonInstant
source: Test instant notification (now)
ar: اختبار فوري الآن

# notificationsSoundPlaying
source: Playing sound directly (no notification).
ar: يتم تشغيل الصوت مباشرة (بدون إشعار).

# notificationsSoundSelectVoice
source: Select a custom adhan voice first.
ar: اختر صوت أذان مخصص أولاً.

# notificationsSoundFailed
source: Failed to play: {error}
ar: فشل التشغيل: {error}

# notificationsButtonSoundOnly
source: Test sound only (no notification)
ar: اختبار الصوت فقط (بدون إشعار)

# notificationsPreviewUnavailable
source: System sound cannot be previewed.
ar: لا يمكن معاينة صوت النظام.

# notificationsPreviewFailed
source: Preview failed: {error}
ar: فشلت المعاينة: {error}

# notificationsVoiceLabel
source: Adhan voice
ar: صوت الأذان

# notificationsPreview
source: Preview
ar: معاينة

# notificationsStop
source: Stop
ar: إيقاف

# leadDefaultLabel
source: Use default
ar: استخدام الافتراضي

source: Quiet hours
ar: ساعات الهدوء

# quietInfo
source: Mute reminders within the selected window.
ar: اكتم صوت التذكيرات ضمن الفترة المحددة.

# quietStartLabel
source: Start
ar: البداية

# quietEndLabel
source: End
ar: النهاية

# quietClear
source: Clear quiet hours
ar: مسح ساعات الهدوء

# quietOff
source: Off
ar: إيقاف

# snoozeLabel
source: Snooze
ar: غفوة

# snoozeInfo
source: Schedule a secondary reminder a few minutes later.
ar: جدولة تذكير إضافي بعد بضع دقائق.

# snoozeMinutesLabel
source: Snooze duration
ar: مدة الغفوة

# telemetryTitle
source: Diagnostics
ar: التشخيصات

# telemetryEnabledBody
source: Telemetry captures anonymized events and errors to help troubleshoot issues. Logs stay on your device unless you share them.
ar: تُسجَّل الأحداث والأخطاء المجهولة للمساعدة في حل المشكلات. تبقى السجلات على جهازك ما لم تشاركها.

# telemetryDisabledBody
source: Telemetry is disabled. Enable it in Appearance settings to capture diagnostics.
ar: التشخيصات غير مفعّلة. فعّلها من إعدادات المظهر لالتقاط السجلات.

# telemetryFilterAll
source: All
ar: الكل

# telemetryFilterEvents
source: Events
ar: الأحداث

# telemetryFilterErrors
source: Errors
ar: الأخطاء

# telemetryEmpty
source: No logs captured yet.
ar: لم يتم التقاط سجلات بعد.

# telemetryEmptyFilter
source: No logs for this filter.
ar: لا توجد سجلات لهذا المرشح.

# telemetryCopyLogs
source: Copy logs
ar: نسخ السجلات

# telemetryClearLogs
source: Clear logs
ar: مسح السجلات

# telemetrySaveLogs
source: Save file
ar: حفظ ملف

# telemetryCopySuccess
source: Copied logs to clipboard
ar: تم نسخ السجلات إلى الحافظة

# telemetryClearConfirmTitle
source: Clear diagnostics log?
ar: مسح سجل التشخيص؟

# telemetryClearConfirmBody
source: Logs are stored locally. Clearing will erase all captured events.
ar: السجلات محفوظة محليًا. سيؤدي المسح إلى حذف جميع الأحداث.

# telemetryClearConfirmCancel
source: Cancel
ar: إلغاء

# telemetryClearConfirmAction
source: Clear
ar: مسح

# telemetryLogCleared
source: Diagnostics log cleared
ar: تم مسح سجل التشخيص

# telemetryNoData
source: No additional data
ar: لا توجد بيانات إضافية

# telemetryEntryCopied
source: Entry copied
ar: تم نسخ السجل

# telemetrySaveSuccess
source: Saved log to {path}
ar: تم حفظ السجل في {path}

# telemetrySaveError
source: Couldn't save log
ar: تعذّر حفظ السجل

# telemetryEnableTitle
source: Enable diagnostics?
ar: تفعيل التشخيصات؟

# telemetryEnableBody
source: Telemetry captures anonymized events and errors to help troubleshoot issues. Logs stay on your device unless you share them.
ar: تُسجَّل الأحداث والأخطاء المجهولة للمساعدة في معالجة المشاكل. تبقى السجلات على جهازك ما لم تشاركها.

# telemetryEnableAccept
source: Enable
ar: تفعيل

# telemetryEnableDecline
source: Not now
ar: لاحقًا

source: Telemetry enabled
ar: تم تفعيل التشخيصات

source: Telemetry disabled
ar: تم إيقاف التشخيصات

# appearancePreviewTitle
source: Preview
ar: معاينة

# appearancePreviewBody
source: See how headings and body text scale with your current settings.
ar: تعرف على شكل العناوين والنصوص مع الإعداد الحالي.

# appearanceTelemetryCardTitle
source: Diagnostics logging
ar: سجل التشخيص

# appearanceTelemetryBody
source: Capture anonymized events to troubleshoot issues.
ar: تسجيل الأحداث والأخطاء لمساعدتنا في حل المشكلات.

# appearanceTelemetryViewLogs
source: View logs
ar: عرض السجلات

# appearanceTextScale
source: Text size
ar: حجم النص

# appearanceTextScaleDescription
source: Adjust the slider to change the size used across the app.
ar: اسحب المؤشر لتغيير حجم النص المستخدم في التطبيق.

# azkarNoResults
source: No azkar match your filters.
ar: لا توجد أذكار مطابقة لعوامل التصفية.

# cachedLocationWarning
source: Using cached location: {label}. Update location for best accuracy.
ar: يتم استخدام موقع محفوظ: {label}. حدّث الموقع للحصول على دقة أعلى.

# collectionAllLabel
source: All
ar: الكل

# collectionChaptersLabel
source: {count} chapters
ar: {count} فصل

# collectionEmpty
source: No collections available right now.
ar: لا توجد مجموعات متاحة حاليًا.

# collectionEntriesLoadError
source: Couldn't load entries: {error}
ar: تعذّر تحميل الأحاديث: {error}

# collectionLoadError
source: Couldn't load collections: {error}
ar: تعذّر تحميل المجموعات: {error}

# collectionNarrationsLabel
source: {count} narrations
ar: {count} رواية

# collectionNoEntries
source: No entries to show.
ar: لا توجد مواد للعرض.

source: Collection not found.
ar: التجميعة غير موجودة.

# collectionSearchHint
source: Search this collection...
ar: ابحث داخل هذه التجميعة...

# fortiesCollectionsTitle
source: Forty Collections
ar: مجموعات الأربعين

# hadithCollectionsTitle
source: Hadith Collections
ar: مجموعات الحديث

# hubTitle
source: Daily Essentials
ar: الأساسيات اليومية

# hubSubtitle
source: Navigate between adhkar, hadith, and forty compilations.
ar: تنقّل بين الأذكار والأحاديث ومجموعات الأربعين.

# hubAzkarTitle
source: Azkar
ar: الأذكار

# hubAzkarDescription
source: Morning and evening supplications with filters.
ar: أذكار الصباح والمساء مع عوامل تصفية مريحة.

# hubAzkarAction
source: Browse azkar
ar: استعرض الأذكار

# hubHadithTitle
source: Hadith collections
ar: مجموعات الحديث

# hubHadithDescription
source: Read curated hadith sets offline.
ar: اقرأ مجموعات الحديث المنتقاة بدون اتصال.

# hubHadithAction
source: Open hadith
ar: فتح الحديث

# hubFortyTitle
source: Forty hadith
ar: الأربعين

# hubFortyDescription
source: Classic compilations of forty narrations.
ar: مجموعات كلاسيكية تضم أربعين رواية.

# hubFortyAction
source: Open forties
ar: فتح الأربعين

# perPrayerLeadTitle
source: Per-prayer lead time
ar: الوقت المسبق لكل صلاة

# perPrayerLeadInfo
source: Override the default lead time for specific prayers.
ar: غيّر الوقت المسبق الافتراضي لكل صلاة على حدة.

# previewTitle
source: Preview (next {count} days)
ar: معاينة (الأيام {count} القادمة)

# previewUnavailable
source: Preview unavailable for this location.
ar: المعاينة غير متاحة لهذا الموقع.

# qiblahAligned
source: You're aligned with the Qiblah.
ar: تم الاصطفاف مع اتجاه القبلة.

# qiblahAlignmentStatus
source: Alignment status
ar: حالة الاصطفاف

# qiblahCalibrationBody
source: Move your phone in a figure-eight pattern to calibrate the compass.
ar: حرّك هاتفك على شكل رقم 8 لمعايرة البوصلة.

# qiblahCalibrationTips
source: Calibration tips
ar: نصائح المعايرة

# qiblahRotateLeft
source: Rotate left by {deg}째
ar: أدر لليسار بمقدار {deg}°

# qiblahRotateRight
source: Rotate right by {deg}째
ar: أدر لليمين بمقدار {deg}°

# snoozeAction
source: Snooze
ar: غفوة

# snoozeScheduled
source: Reminder snoozed for {minutes} minutes.
ar: تم تأجيل التذكير لمدة {minutes} دقيقة.

# snoozeUnavailable
source: Snooze isn't available for this prayer.
ar: الغفوة غير متاحة لهذه الصلاة.

# timezoneWarning
source: Device timezone differs from the calculation timezone. Check Settings.
ar: توقيت الجهاز يختلف عن التوقيت المستخدم للحساب. تحقق من الإعدادات.

source: Unknown date
ar: تاريخ غير معروف
